app/Controllers/MainController.php

    public function store(){

        $data=[
            "name"=>$this->request->getPost("name"),
            "email"=>$this->request->getPost("email"),
            "phone"=>$this->request->getPost("phone"),
            "course"=>$this->request->getPost("course"),
        ];
        $this->studentModel->insert($data);
---
INSERT INTO `students` (`name`, `email`, `phone`, `course`, `created_at`, `updated_at`) VALUES ('bb', 'nn', 'vvv', 'bbbb', '2023-03-17 04:19:26', '2023-03-17 04:19:26')

    public function fetch(){
        $data["students"]=$this->studentModel->findAll();
---
SELECT *
FROM `students`

    public function update(){
        $data["student"]=$this->studentModel->find($this->request->getPost("stud_id"));
---
SELECT *
FROM `students`
WHERE `students`.`id` = '1'

    public function updateSave(){

        $id=$this->request->getPost("id");
        $data=[
            "name"=>$this->request->getPost("name"),
            "email"=>$this->request->getPost("email"),
            "phone"=>$this->request->getPost("phone"),
            "course"=>$this->request->getPost("course"),
        ];

        if($this->studentModel->update($id,$data)){
---
UPDATE `students` SET `name` = 'Nakiganda Esther Joy', `email` = 'EstherJoy@gmail.com', `phone` = '07889676567', `course` = 'LLB', `updated_at` = '2023-05-02 03:01:10'
WHERE `students`.`id` IN ('4')